from colorama import init, Fore, Back, Style

# Ініціалізуємо бібліотеку
init(autoreset=True)  # Встановлюємо autoreset в True для автоматичного скидання кольорів

# Приклади використання атрибутів та методів
print(Fore.RED + "Цей текст червоний")  # Змінює колір тексту на червоний
print(Back.BLUE + "З синім фоном")  # Змінює колір фону на синій
print(Style.BRIGHT + "Яскравий текст")  # Зроблює текст яскравішим

# Приклади зміни кольору тексту і фону разом
print(Fore.YELLOW + Back.GREEN + "Жовтий текст на зеленому фоні")

# Після виводу кольорового тексту кольори можна автоматично скидати
print("Цей текст має колір за замовчуванням")

# Скидання стилю
print(Style.RESET_ALL + "Цей текст має стиль за замовчуванням")

